<a href="https://colab.research.google.com/github/Georgitanev/Python-OOP/blob/master/pandas_sorting_classes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Sort by price with pandas

In [1]:
import pandas as pd
 
cars = {'Brand': ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4'],
        'Price': [22000,25000,27000,35000],
        'Year': [2015,2013,2018,2018]
        }
 
df = pd.DataFrame(cars, columns= ['Brand', 'Price','Year'])

print (df)

            Brand  Price  Year
0     Honda Civic  22000  2015
1  Toyota Corolla  25000  2013
2      Ford Focus  27000  2018
3         Audi A4  35000  2018

In [14]:
""" sorting by brand"""
# sort - ascending order
import pandas as pd

# sort Brand - ascending order

def sort_by(df):
  df.sort_values(by=['Year'])
  return df

print(sort_by(df))

            Brand  Price  Year
1  Toyota Corolla  25000  2013
0     Honda Civic  22000  2015
2      Ford Focus  27000  2018
3         Audi A4  35000  2018

Sort by multiple columns – case 1

In [12]:
def sort_by_year_price(df):
  df.sort_values(by=['Year','Price'])
  print(df)
  return df
print(sort_by_year_price(df))

            Brand  Price  Year
1  Toyota Corolla  25000  2013
0     Honda Civic  22000  2015
2      Ford Focus  27000  2018
3         Audi A4  35000  2018
            Brand  Price  Year
1  Toyota Corolla  25000  2013
0     Honda Civic  22000  2015
2      Ford Focus  27000  2018
3         Audi A4  35000  2018

Sort by multiple columns – case 2

In [17]:
# Creating the dataframe  
df_numbers = pd.DataFrame({'A': [1, 1, 2, 1, 2],
                   'B': [0, 2, 3, 4, 5],
                   'C': [1, 2, 1, 1, 2]}, columns=['A', 'B', 'C'])
df_numbers

   A  B  C
0  1  0  1
1  1  2  2
2  2  3  1
3  1  4  1
4  2  5  2

In [23]:
def group_by(df_numbers):
  return df_numbers.groupby('A').mean()

print(group_by(df_numbers))

     B         C
A
1  2.0  1.333333
2  4.0  1.500000

# All that in class :)

In [29]:
class MyClass:

    def __init__(self, my_dataframe):
        self.my_dataframe = my_dataframe
    
    def sort_by(self):
      self.df = self.my_dataframe.sort_values(by=['Year'])
      return self.df

    def sort_by_year_price(self):
      self.df = self.df.sort_values(by=['Year','Price'])
      return self.df
    
    def group_by(self):
      return df_numbers.groupby('A').mean()



# print(group_by(df_numbers))

a = MyClass(df)
b = MyClass(df_numbers)

print(a.sort_by())
print()
print(b.group_by())

# b = MyClass(df_numbers)

# print(a.sort_by())
# print()
# print(b)

            Brand  Price  Year
1  Toyota Corolla  25000  2013
0     Honda Civic  22000  2015
2      Ford Focus  27000  2018
3         Audi A4  35000  2018

     B         C
A
1  2.0  1.333333
2  4.0  1.500000